{
    "_comment": "This JSON was built based on the original map structure. Copyright (C) Simon Schampijer",
    "opening": "Hey there, brave adventurer! Are you ready for a super fun journey? Let's go...",
    "genericMsgs": {
        "missingCmd": "Oops, looks like you forgot to type a command. Please try again.",
        "invalidCmd": "Hmm, I don't know that command. If you're not sure what to do, just type 'help'.",
        "helpCmd": "Commands: n (north), s (south), w (west), e (east), take [item], look, inventory, help, restart, quit",
        "deadend": "Oh no, there's nowhere to go here. Try looking around for a different path.",
        "emptyInventory": "Your backpack is empty. Keep exploring to find things!",
        "noItemHere": "There's no such item here. Keep looking!"
    },
    "currentRoom": "Starting Room",
    "startRoom": "Starting Room",
    "exitRoom": "Dragon Room",
    "rooms": {
        "Starting Room": {
            "name": "Starting Room",
            "description": "You're in a big room with funny drawings on the wall.",
            "items": ["flashlight"],
            "north": "Secret Room",
            "east": "Dragon Room"
        },
        "Secret Room": {
            "name": "Secret Room",
            "requiredItem": "flashlight",
            "failToEnter": "It's too dark in here. You need to find a flashlight before you can go in.",
            "entryMsg": "With your flashlight on, you can see everything in the room.",
            "description": "This room is full of cool secret codes on the wall.",
            "items": ["magic key"],
            "south": "Starting Room",
            "east" : "Treasure Room"
        },
        "Treasure Room": {
            "name": "Treasure Room",
            "requiredItem": "magic key",
            "failToEnter": "The door is locked. You need a key to open it.",
            "entryMsg": "Using your magic key, you open the door and find a room full of treasure and a shiny sword.",
            "description": "There are lots of old chests and shiny things in this room.",
            "items": ["awesome sword"],
            "south": "Dragon Room",
            "west": "Secret Room"
        },
        "Dragon Room": {
            "name": "Dragon Room",
            "requiredItem": "awesome sword",
            "failToEnter": "There's a big scary dragon in this room. You need to find a sword before you can fight it.",
            "description": "You see the dragon and swords of fallen warriors on his feet",
            "emptyDescription": "This room used to belong to a big scary dragon, but not anymore!",
            "npcType": "enemies",
            "items": []
        }
    },
    "npcs": {
        "enemies": {
            "name": "Big Scary Dragon",
            "description": "This dragon is big and loud, with fiery breath. But you're a brave adventurer!",
            "toDefeat": "awesome sword",
            "youWin": "Great job! With your awesome sword, you beat the dragon and saved the day!"
        }
    },
    "inventory": [

    ]
}
